In [4]:
# Import dependencies:

import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import scipy.stats as st

# Read csv file and store into dataframe:

complete_df = pd.read_csv("../Resources/athlete_events.csv")
complete_df

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
271111,135569,Andrzej ya,M,29.0,179.0,89.0,Poland-1,POL,1976 Winter,1976,Winter,Innsbruck,Luge,Luge Mixed (Men)'s Doubles,NaN
271112,135570,Piotr ya,M,27.0,176.0,59.0,Poland,POL,2014 Winter,2014,Winter,Sochi,Ski Jumping,"Ski Jumping Men's Large Hill, Individual",NaN
271113,135570,Piotr ya,M,27.0,176.0,59.0,Poland,POL,2014 Winter,2014,Winter,Sochi,Ski Jumping,"Ski Jumping Men's Large Hill, Team",NaN
271114,135571,Tomasz Ireneusz ya,M,30.0,185.0,96.0,Poland,POL,1998 Winter,1998,Winter,Nagano,Bobsleigh,Bobsleigh Men's Four,NaN
271115,135571,Tomasz Ireneusz ya,M,34.0,185.0,96.0,Poland,POL,2002 Winter,2002,Winter,Salt Lake City,Bobsleigh,Bobsleigh Men's Four,NaN

complete_df

In [22]:
#cleanup by ht_wt .. there is no cleaner way 

cleaned_up_ht_wt = complete_df.dropna(subset= ["Height", "Weight",  "Medal"] )
cleaned_up_ht_wt

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
40,16,Juhamatti Tapio Aaltonen,M,28.0,184.0,85.0,Finland,FIN,2014 Winter,2014,Winter,Sochi,Ice Hockey,Ice Hockey Men's Ice Hockey,Bronze
41,17,Paavo Johannes Aaltonen,M,28.0,175.0,64.0,Finland,FIN,1948 Summer,1948,Summer,London,Gymnastics,Gymnastics Men's Individual All-Around,Bronze
42,17,Paavo Johannes Aaltonen,M,28.0,175.0,64.0,Finland,FIN,1948 Summer,1948,Summer,London,Gymnastics,Gymnastics Men's Team All-Around,Gold
44,17,Paavo Johannes Aaltonen,M,28.0,175.0,64.0,Finland,FIN,1948 Summer,1948,Summer,London,Gymnastics,Gymnastics Men's Horse Vault,Gold
48,17,Paavo Johannes Aaltonen,M,28.0,175.0,64.0,Finland,FIN,1948 Summer,1948,Summer,London,Gymnastics,Gymnastics Men's Pommelled Horse,Gold
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
271078,135553,Galina Ivanovna Zybina (-Fyodorova),F,25.0,168.0,80.0,Soviet Union,URS,1956 Summer,1956,Summer,Melbourne,Athletics,Athletics Women's Shot Put,Silver
271080,135553,Galina Ivanovna Zybina (-Fyodorova),F,33.0,168.0,80.0,Soviet Union,URS,1964 Summer,1964,Summer,Tokyo,Athletics,Athletics Women's Shot Put,Bronze
271082,135554,Bogusaw Zych,M,28.0,182.0,82.0,Poland,POL,1980 Summer,1980,Summer,Moskva,Fencing,"Fencing Men's Foil, Team",Bronze
271102,135563,Olesya Nikolayevna Zykina,F,19.0,171.0,64.0,Russia,RUS,2000 Summer,2000,Summer,Sydney,Athletics,Athletics Women's 4 x 400 metres Relay,Bronze
271103,135563,Olesya Nikolayevna Zykina,F,23.0,171.0,64.0,Russia,RUS,2004 Summer,2004,Summer,Athina,Athletics,Athletics Women's 4 x 400 metres Relay,Silver

In [23]:
my_ht_cut_ratios = [ 0, 150 ,165, 180,195, 240 ]
my_ht_bin = (cleaned_up_ht_wt, my_ht_cut_ratios)
my_ht_bin

(            ID                                 Name Sex   Age  Height  Weight  \
 40          16             Juhamatti Tapio Aaltonen   M  28.0   184.0    85.0
 41          17              Paavo Johannes Aaltonen   M  28.0   175.0    64.0
 42          17              Paavo Johannes Aaltonen   M  28.0   175.0    64.0
 44          17              Paavo Johannes Aaltonen   M  28.0   175.0    64.0
 48          17              Paavo Johannes Aaltonen   M  28.0   175.0    64.0
 ...        ...                                  ...  ..   ...     ...     ...
 271078  135553  Galina Ivanovna Zybina (-Fyodorova)   F  25.0   168.0    80.0
 271080  135553  Galina Ivanovna Zybina (-Fyodorova)   F  33.0   168.0    80.0
 271082  135554                         Bogusaw Zych   M  28.0   182.0    82.0
 271102  135563            Olesya Nikolayevna Zykina   F  19.0   171.0    64.0
 271103  135563            Olesya Nikolayevna Zykina   F  23.0   171.0    64.0

                 Team  NOC        Games  Year  Season       City       Sport  \
 40           Finland  FIN  2014 Winter  2014  Winter      Sochi  Ice Hockey
 41           Finland  FIN  1948 Summer  1948  Summer     London  Gymnastics
 42           Finland  FIN  1948 Summer  1948  Summer     London  Gymnastics
 44           Finland  FIN  1948 Summer  1948  Summer     London  Gymnastics
 48           Finland  FIN  1948 Summer  1948  Summer     London  Gymnastics
 ...              ...  ...          ...   ...     ...        ...         ...
 271078  Soviet Union  URS  1956 Summer  1956  Summer  Melbourne   Athletics
 271080  Soviet Union  URS  1964 Summer  1964  Summer      Tokyo   Athletics
 271082        Poland  POL  1980 Summer  1980  Summer     Moskva     Fencing
 271102        Russia  RUS  2000 Summer  2000  Summer     Sydney   Athletics
 271103        Russia  RUS  2004 Summer  2004  Summer     Athina   Athletics

                                          Event   Medal
 40                 Ice Hockey Men's Ice Hockey  Bronze
 41      Gymnastics Men's Individual All-Around  Bronze
 42            Gymnastics Men's Team All-Around    Gold
 44                Gymnastics Men's Horse Vault    Gold
 48            Gymnastics Men's Pommelled Horse    Gold
 ...                                        ...     ...
 271078              Athletics Women's Shot Put  Silver
 271080              Athletics Women's Shot Put  Bronze
 271082                Fencing Men's Foil, Team  Bronze
 271102  Athletics Women's 4 x 400 metres Relay  Bronze
 271103  Athletics Women's 4 x 400 metres Relay  Silver

 [30196 rows x 15 columns], [0, 150, 165, 180, 195, 240])

In [33]:
ht_medal  = cleaned_up_ht_wt [["Height" , "Medal"]]
ht_medal

        Height   Medal
40       184.0  Bronze
41       175.0  Bronze
42       175.0    Gold
44       175.0    Gold
48       175.0    Gold
...        ...     ...
271078   168.0  Silver
271080   168.0  Bronze
271082   182.0  Bronze
271102   171.0  Bronze
271103   171.0  Silver

[30196 rows x 2 columns]

In [37]:
bronze_list_ht = ht_medal[ht_medal['Medal'] == 'Bronze']
bronze_list_ht

        Height   Medal
40       184.0  Bronze
41       175.0  Bronze
50       175.0  Bronze
61       176.0  Bronze
64       176.0  Bronze
...        ...     ...
271032   181.0  Bronze
271048   197.0  Bronze
271080   168.0  Bronze
271082   182.0  Bronze
271102   171.0  Bronze

[10154 rows x 2 columns]

In [39]:
silver_list_ht = ht_medal[ht_medal['Medal'] == 'Silver']
silver_list_ht

        Height   Medal
63       176.0  Silver
67       176.0  Silver
92       189.0  Silver
163      179.0  Silver
175      182.0  Silver
...        ...     ...
271013   189.0  Silver
271015   200.0  Silver
271046   175.0  Silver
271078   168.0  Silver
271103   171.0  Silver

[9874 rows x 2 columns]

In [40]:
gold_list_ht = ht_medal[ht_medal['Medal'] == 'Gold']
gold_list_ht

        Height Medal
42       175.0  Gold
44       175.0  Gold
48       175.0  Gold
60       176.0  Gold
73       176.0  Gold
...        ...   ...
270981   182.0  Gold
271009   167.0  Gold
271016   200.0  Gold
271049   197.0  Gold
271076   168.0  Gold

[10168 rows x 2 columns]

In [47]:
wt_medal  = cleaned_up_ht_wt [["Weight" , "Medal"]]
wt_medal

        Weight   Medal
40        85.0  Bronze
41        64.0  Bronze
42        64.0    Gold
44        64.0    Gold
48        64.0    Gold
...        ...     ...
271078    80.0  Silver
271080    80.0  Bronze
271082    82.0  Bronze
271102    64.0  Bronze
271103    64.0  Silver

[30196 rows x 2 columns]

In [45]:
bronze_list_wt = wt_medal[wt_medal['Medal'] == 'Bronze']
bronze_list_wt

        Weight   Medal
40        85.0  Bronze
41        64.0  Bronze
50        64.0  Bronze
61        85.0  Bronze
64        85.0  Bronze
...        ...     ...
271032    78.0  Bronze
271048    93.0  Bronze
271080    80.0  Bronze
271082    82.0  Bronze
271102    64.0  Bronze

[10154 rows x 2 columns]

In [51]:
silver_list_wt = wt_medal[wt_medal['Medal'] == 'Silver']
silver_list_wt

        Weight   Medal
63        85.0  Silver
67        85.0  Silver
92        72.0  Silver
163       80.0  Silver
175       86.0  Silver
...        ...     ...
271013    80.0  Silver
271015    93.0  Silver
271046    70.0  Silver
271078    80.0  Silver
271103    64.0  Silver

[9874 rows x 2 columns]

In [52]:
gold_list_wt = wt_medal[wt_medal['Medal'] == 'Gold']
gold_list_wt

        Weight Medal
42        64.0  Gold
44        64.0  Gold
48        64.0  Gold
60        85.0  Gold
73        85.0  Gold
...        ...   ...
270981    90.0  Gold
271009    60.0  Gold
271016    93.0  Gold
271049    93.0  Gold
271076    80.0  Gold

[10168 rows x 2 columns]

In [54]:
bmi_medal = cleaned_up_ht_wt[["Height", "Weight", "Medal", "Sport"]]
bmi_medal

        Height  Weight   Medal       Sport
40       184.0    85.0  Bronze  Ice Hockey
41       175.0    64.0  Bronze  Gymnastics
42       175.0    64.0    Gold  Gymnastics
44       175.0    64.0    Gold  Gymnastics
48       175.0    64.0    Gold  Gymnastics
...        ...     ...     ...         ...
271078   168.0    80.0  Silver   Athletics
271080   168.0    80.0  Bronze   Athletics
271082   182.0    82.0  Bronze     Fencing
271102   171.0    64.0  Bronze   Athletics
271103   171.0    64.0  Silver   Athletics

[30196 rows x 4 columns]

In [57]:
bmi_medal["BMI"] = bmi_medal["Weight"] / bmi_medal["Height"]
bmi_medal_rating = bmi_medal[["BMI","Medal"]]
bmi_medal_rating

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

             BMI   Medal
40      0.461957  Bronze
41      0.365714  Bronze
42      0.365714    Gold
44      0.365714    Gold
48      0.365714    Gold
...          ...     ...
271078  0.476190  Silver
271080  0.476190  Bronze
271082  0.450549  Bronze
271102  0.374269  Bronze
271103  0.374269  Silver

[30196 rows x 2 columns]